keyword = {
    # 声明变量
    1: "auto",
    2: "int",
    3: "double",
    4: "float",
    5: "char",
    6: "string",
    7: "long",

    8: "struct",

    9: "register",
    10: "typedef",
    11: "short",
    12: "union",

    # 限定、修饰符号
    13: "const",
    14: "unsigned",
    15: "signed",
    16: "static",
    17: "extern",

    # 循环，分支语句
    18: "for",
    19: "while",
    20: "switch",
    21: "case",
    22: "goto",
    23: "if",
    24: "else",
    25: "continue",
    26: "break",
    27: "do",
    28: "default",

    # 输入，输出
    29: "get",
    30: "put",

    # 函数类别
    31: "void",
    32: "return",
    33: "volatile",

    # 运算符
    34: "+",
    35: "-",
    36: "*",
    37: "/",
    38: "=",
    39: ">",
    40: "<",
    41: "&",
    42: "|",
    43: "!",
    44: "%",

    45: "++",
    46: "--",
    47: "**",
    48: "+=",
    49: "-=",
    50: "*=",
    51: "/=",

    52: "==",
    53: ">=",
    54: "<=",
    55: "!=",

    # 分界符
    56: "(",
    57: ")",
    58: "[",
    59: "]",
    60: "{",
    61: "}",
    62: "#",
    63: ",",
    64: ";",
    65: "'",
    66: "\"",
    67: ":",

    # 整数
    68: "digit",
    69: "float",

    # 布尔常量
    70: "bool",
    71: "id",
}